{
	"short_description": "Software Developer",
	"about_me": {
		"title": "About Me",
		"body": "Hello! I'm Rubén Ruiz Pedreira, a passionate software engineer with an insatiable curiosity for technology and a constant desire to learn. Currently, I'm contributing my experience and skills to the Netex Learning team, where I work to improve the user experience through the development of new features, optimization of existing code, and resolution of technical challenges. I firmly believe in Domain-Driven Design (DDD) and strive to follow the best programming practices. In my free time, I love experimenting with new technologies and bringing my ideas to life through personal projects."
	},
	"my_career_path": {
		"title": "My Career Path",
		"body": "My adventure in the world of technology began at Nemon Intelligence in Business, where I started as a Junior Web Developer and then moved to the Quality Management area. Now, at Netex Learning, I'm polishing my skills and also taking on freelance projects that allow me to explore new applications of my experience."
	},
	"my_work": {
		"title": "Highlighted Projects",
		"body": "Throughout my career, I've had the opportunity to work on a variety of interesting projects. Some of my most notable contributions include the development of a Wallet Application to manage cryptocurrency portfolios and a DevOps CLI tool to monitor deployed services. At SmartED, Netex Learning, we have managed to implement automatic tests with Cypress."
	},
	"interests": {
		"title": "Interests",
		"body": "In addition to programming, I'm fascinated by architecture and systems, and I'm always excited to explore new technologies like Docker and Kubernetes. When I'm not immersed in the world of technology, you'll probably find me enjoying electronic music, another of my great passions."
	},
	"expertise": {
		"title": "Expertise",
		"body": "Over the years, I've acquired a wide set of skills, mastering various programming languages and tools. My experience includes TypeScript and Golang, Rust, and frameworks like Svelte, and NextJS, among others. I'm also a strong advocate for quality assurance and integrated end-to-end testing with Cypress into my development workflow."
	},
	"connect_with_me": {
		"title": "Connect With Me",
		"body1": "I'm always open to new opportunities and collaborations. Don't hesitate to connect with me on",
		"body2": "or take a look at my work on",
		"body3": "I'm excited about what the future can bring and hope to have the opportunity to work on projects that make a difference."
	}
}
