{
	"short_description": "Desarrollador de Software",
	"about_me": {
		"title": "Acerca de Mí",
		"body": "¡Hola! Soy Rubén Ruiz Pedreira, un apasionado ingeniero de software con una insaciable curiosidad por la tecnología y un constante deseo de aprender. Actualmente, estoy aportando mi experiencia y habilidades al equipo de Netex Learning, donde trabajo para mejorar la experiencia del usuario a través del desarrollo de nuevas funcionalidades, la optimización del código existente y la resolución de desafíos técnicos. Creo firmemente en el Diseño Guiado por el Dominio (DDD) y me esfuerzo por seguir las mejores prácticas de programación. En mi tiempo libre, me encanta experimentar con nuevas tecnologías y dar vida a mis ideas a través de proyectos personales."
	},
	"my_career_path": {
		"title": "Mi Trayectoria Profesional",
		"body": "Mi aventura en el mundo de la tecnología comenzó en Nemon Intelligence in Business, donde empecé como Desarrollador Web Junior y luego me trasladé al área de Gestión de Calidad. Ahora, en Netex Learning, estoy puliendo mis habilidades y también tomando proyectos freelance que me permiten explorar nuevas aplicaciones de mi experiencia."
	},
	"my_work": {
		"title": "Proyectos Destacados",
		"body": "A lo largo de mi carrera, he tenido la oportunidad de trabajar en una variedad de proyectos interesantes. Algunas de mis contribuciones más notables incluyen el desarrollo de una Aplicación de Billetera para gestionar carteras de criptomonedas y una herramienta DevOps CLI para supervisar servicios desplegados. En SmartED, Netex Learning, hemos logrado implementar pruebas automáticas con Cypress."
	},
	"interests": {
		"title": "Intereses",
		"body": "Además de la programación, me fascina la arquitectura y los sistemas, y siempre estoy emocionado por explorar nuevas tecnologías como Docker y Kubernetes. Cuando no estoy sumergido en el mundo de la tecnología, probablemente me encontrarás disfrutando de la música electrónica, otra de mis grandes pasiones."
	},
	"expertise": {
		"title": "Experiencia",
		"body": "A lo largo de los años, he adquirido un amplio conjunto de habilidades, dominando varios lenguajes de programación y herramientas. Mi experiencia incluye TypeScript y Golang, Rust, y frameworks como Svelte, y NextJS, entre otros. También soy un firme defensor de la garantía de calidad e integré las pruebas de extremo a extremo con Cypress en mi flujo de trabajo de desarrollo."
	},
	"connect_with_me": {
		"title": "Conéctate Conmigo",
		"body1": "Siempre estoy abierto a nuevas oportunidades y colaboraciones. No dudes en conectarte conmigo en",
		"body2": "o echa un vistazo a mi trabajo en",
		"body3": "Estoy emocionado por lo que el futuro puede traer y espero tener la oportunidad de trabajar en proyectos que hagan una diferencia."
	}
}
